package Algorithms.trees;

/*Бинарная пирамида (двоичная куча) - абстрактный тип данных реализующий функционал
*   очереди с приоритетом
* Бинарная пирамида - это двоичное дерево для которого выполнены три условия:
*   - значение в любой вершине не больше (если куча для минимума) чем значения ее потомков
*   - на i-ом слое 2i вершин кроме последнего слои нумеруются с нуля
*   - последний слой заполнен слева направо
*
* - левый индекс = 2i+1, правый индекс = 2i+2
* - в основном хранится в массивах
*/


public class BinaryPiramide {
}
